In [2]:
import pandas as pd
import numpy as np
# Pandas数值运算

In [3]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [4]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [5]:
# 通用函数：保留索引
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [6]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [7]:
# 通用函数：索引对齐
# Series索引对齐
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name='population')
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [8]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [9]:
A = pd.Series([2, 4, 6], index=[0, 1, 2]) 
B = pd.Series([1, 3, 5], index=[1, 2, 3]) 
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [10]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [12]:
# DataFrame索引对齐
A = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('AB'))
A

    A   B
0   0  11
1  11  16

In [14]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  4  8  6
1  1  3  8
2  1  9  8

In [15]:
A + B

      A     B   C
0   8.0  15.0 NaN
1  14.0  17.0 NaN
2   NaN   NaN NaN

In [16]:
fill = A.stack().mean() 
A.add(B, fill_value=fill)

      A     B     C
0   8.0  15.0  15.5
1  14.0  17.0  17.5
2  18.5  10.5  17.5

In [17]:
fill

9.5

In [3]:
ChinaBank = pd.read_csv('ChinaBank.csv', index_col='Date', parse_dates=['Date'] )

In [4]:
ChinaBank['Close']

Date
2014-01-02    2.61
2014-01-03    2.56
2014-01-06    2.53
2014-01-07    2.52
2014-01-08    2.51
              ...
2015-04-24    4.66
2015-04-27    4.81
2015-04-28    5.06
2015-04-29    4.97
2015-04-30    4.84
Name: Close, Length: 345, dtype: float64

In [5]:
ChinaBank['Close'].diff(1) # 计算一阶差分

Date
2014-01-02     NaN
2014-01-03   -0.05
2014-01-06   -0.03
2014-01-07   -0.01
2014-01-08   -0.01
              ...
2015-04-24   -0.14
2015-04-27    0.15
2015-04-28    0.25
2015-04-29   -0.09
2015-04-30   -0.13
Name: Close, Length: 345, dtype: float64

In [6]:
ChinaBank['Close'].diff(1).diff(1) # 二阶差分

Date
2014-01-02             NaN
2014-01-03             NaN
2014-01-06    2.000000e-02
2014-01-07    2.000000e-02
2014-01-08   -4.440892e-16
                  ...
2015-04-24   -8.000000e-02
2015-04-27    2.900000e-01
2015-04-28    1.000000e-01
2015-04-29   -3.400000e-01
2015-04-30   -4.000000e-02
Name: Close, Length: 345, dtype: float64